            وِیژگی: تعیین وضعیت فعال/غیرفعال کنترلهای صفحه

            معمولا در یک فرم کنترلهای صفحه با هم در ارتباط هستند این ارتباط به دو شکل میتواند اثرگذار باشد:
            - تغییر وضعیت کنترل از فعال به غیرفعال ویا برعکس
            - مقداردهی کنترل
            کنترل تاثیرگذار را والد و کنترل تاثیر پذیر را فرزند مینامیم
            ارتباط بین کنترلها، زمانی در فرم اثرگذاری خود را بروز داده و نشان میدهد که رویدادی در فرم رخ دهد تا فرآیند اثرگذاری آغاز شود.
            این رویداد، تغییر مقدار کنترلهای واقع در رابطه، میباشد. یعنی به عنوان مثال مقدار کنترل والد یا مقدار کنترل فرزند تغییر کند.
            این رویداد تغییر مقدار به دو صورت میتواند در فرم رخ دهد:
            - تعامل کاربر نهایی با فرم
            - در این حالت فرآیند اثرگذاری همواره اجرا میشود
            - تغییر مقدار درنتیجه اجرای کد برنامه نویس
            - در این حالت فرآیند اثرگذاری تنها در صورت درخواست اجرا میشود

            الگوی سناریو: رفتار پیش فرض
            در اثرگذاری از نوع تغییر وضعیت، رفتار پیش فرض که بدون انجام تنظیمات خاصی صرفا با مشخص کردن والد و فرزند قابل مشاهده است به این صورت میباشد.
            در رفتار پیش فرض تغییر مقدار فرزند تاثیری در وضعیت کنترل والد ندارد
            - اگر کنترل والد مقدار نداشته باشد کنترل فرزند غیرفعال بوده و امکان مقدار دهی آن وجود ندارد این نیازمندی از آنجا نشئات میگرد که مقادیر قابل انتخاب برای کنترل فرزند از منظر کسب و کار وابسته به مقدار انتخاب شده برای کنترل والد بوده، بنابراین منطقی به نظر میرسد که تا زمانی که مقداری برای کنترل والد مشخص نشود نباید کنترل فرزند فعال باشد چون نمیتوان لیست مقادیر قابل انتخاب برای کنترل فرزند را مشخص کرد.
            - به محض انتخاب مقدار برای کنترل والد، کنترل فرزند فعال شده و به کاربر لیست مقادیر قابل انتخاب را ارائه کرده و کاربر میتواند از میان این مجموعه مقداری را برای کنترل فرزند مشخص کند.
            - حال چنانچه کنترل والد و کنترل فرزند هر دو دارای مقدار باشند و کاربر مقدار کنترل والد را حذف کند بلافاصله طبق منطق بیان شده مقدار کنترل فرزند از منظر کسب و کار نامعتبر شده بنابراین مقدار انتخابی برای کنترل فرزند نیز حذف میشود و مجددا به حالت غیرفعال تغییر وضعیت میدهد.
            - در حالتی که کنترل والد و فرزند هر دو دارای مقدار باشند و کاربر بجای حذف مقدار کنترل والد تنها آن مقدار را تغییر دهد در این حالت تنها مقدار کنترل فرزند حذف شده و دیگه تغییروضعیتی در آن رخ نمیدهد.

            با فرض اینکه در لود اولیه ی صفحه ی جاری قرار نداریم
            و اینکه کنترل والد مقدار <parentHasValue>
            و اینکه فرزند مقدار <childHasValue>
            و با فرض اینکه تغییری از نوع <changeAction> بر روی <relationParty> رخ داده
            هنگامی که پردازش گراف روابط آغاز شود

            آنگاه وضعیت کنترل والد <parentEnabledState> میشود
            و وضعیت کنترل فرزند <childEnabledState> میشود

            نمونه ها:
            | parentHasValue | childHasValue | changeAction | relationParty | parentEnabledState | childEnabledState |
            | false          | false         | dc           | irrelevant    | true               | false             |
            | true           | false         | set          | parent        | true               | true              |
            | true           | true          | clear        | parent        | true               | false             |
            | true           | true          | set          | child         | true               | 5                 |
            | 100            | 100           | 100          | 100           | 100                | 100               |
